export const Lecture = [
  {
    weekSchedule: [
      {
        day: "السبت",
        groups: {
          A: {
            lectures: {
              برمجة: {
                time: "8:30 || 9:15",
                classroom: "م.برمجه",
              },
              اتصالات: {
                time: "9:30 || 10:15",
                classroom: "م.اتصالات",
              },
              الكترونيك: {
                time: "11:30 || 12:15",
                classroom: "م.دوائر",
              },
              "اللغه الانكليزيه": {
                time: "12:30 || 1:15",
                classroom: "قاعه 25",
              },
            },
          },
          B: {
            lectures: {
              اتصالات: {
                time: "8:30 || 9:15",
                classroom: "م.اتصالات",
              },
              برمجه: {
                time: "9:30 || 10:15",
                classroom: "م.برمجه",
              },
              "تطبيقات الحاسوب": {
                time: "10:30 || 12:15",
                classroom: "م.تطبيقات",
              },
              "اللغه الانكليزيه": {
                time: "12:30 || 1:15",
                classroom: "قاعه رقم 25",
              },
              الكترونيك: {
                time: "1:15 || 2:00",
                classroom: "م.دوائر",
              },
            },
          },
          C: {
            lectures: {
              الكترونيك: {
                time: "8:30 || 9:15",
                classroom: "م.دوائر",
              },
              "اللغه الانكليزيه": {
                time: "9:30 || 10:15",
                classroom: "قاعه رقم 25",
              },
              برمجه: {
                time: "10:30 || 11:15",
                classroom: "م.برمجه",
              },
              اتصالات: {
                time: "11:30 || 12:15",
                classroom: "م.اتصالات",
              },
              "تطبيقات الحاسوب": {
                time: "12:30 || 2:00",
                classroom: "م.اتصالات",
              },
            },
          },
          D: {
            lectures: {
              "اللغه الانكليزيه": {
                time: "9:30 || 10:15",
                classroom: "قاعه رقم 25",
              },
              اتصالات: {
                time: "10:30 || 11:15",
                classroom: "م.اتصالات",
              },
              برمجه: {
                time: "11:30 || 12:15",
                classroom: "م.برمجه",
              },
              الكترونيك: {
                time: "12:30 || 1:15",
                classroom: "م.دوائر",
              },
            },
          },
          E: {
            lectures: {
              الكترونيك: {
                time: "9:30 || 10:15",
                classroom: "م.الكترونيك",
              },
              "اللغه الانكليزيه": {
                time: "11:30 || 12:15",
                classroom: "قاعه رقم 25",
              },
              برمجه: {
                time: "12:30 || 1:15",
                classroom: "م.برمجه",
              },
              اتصالات: {
                time: "1:15 || 2:00",
                classroom: "م.اتصالات",
              },
            },
          },
          F: {
            lectures: {
              "تطبيقات الحاسوب": {
                time: "8:30 || 10:15",
                classroom: "م.تطبيقات",
              },
              الكترونيك: {
                time: "10:30 || 11:15",
                classroom: "م.دوائر",
              },
              "اللغه الانكليزيه": {
                time: "11:30 || 12:15",
                classroom: "قاعه رقم 25",
              },
              اتصالات: {
                time: "12:30 || 1:15",
                classroom: "م.اتصالات",
              },
              برمجه: {
                time: "1:15 || 2:00",
                classroom: "م.برمجه",
              },
            },
          },
          مسائي: {
            lectures: {
              برمجه: {
                time: "8:30 || 9:15",
                classroom: "م.برمجه",
              },
              "اللغه الانكليزيه": {
                time: "9:30 || 10:15",
                classroom: "قاعه رقم 25",
              },
              "تطبيقات الحاسوب": {
                time: "10:30 || 12:15",
                classroom: "م.تطبيقات",
              },
              "اسس اتصالات": {
                time: "12:30 || 1:15",
                classroom: "م.اتصالات",
              },
              الكترونيك: {
                time: "1:15 || 2:00",
                classroom: "م.دوائر",
              },
            },
          },
        },
      },
      {
        day: "الاحد",
        groups: {
          A: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          B: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          C: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          D: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          E: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          F: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          مسائي: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
        },
      },
      {
        day: "الاثنين",
        groups: {
          A: {
            lectures: {
              "اجهزه وقياسات": {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 31",
              },
              "جرائم حزب البعث": {
                time: "10:30 || 11:15",
                classroom: "قاعه رقم 27",
              },
              "معماريه الحاسوب": {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 26",
              },
            },
          },
          B: {
            lectures: {
              "اجهزه وقياسات": {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 31",
              },
              "جرائم حزب البعث": {
                time: "10:30 || 11:15",
                classroom: "قاعه رقم 27",
              },
              "معماريه الحاسوب": {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 26",
              },
            },
          },
          C: {
            lectures: {
              "جرائم حزب البعث": {
                time: "9:30 || 10:15",
                classroom: "قاعه رقم 26",
              },
              الكترونيك: {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 31",
              },
              "اجهزه وقياسات": {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 27",
              },
            },
          },
          D: {
            lectures: {
              "جرائم حزب البعث": {
                time: "9:30 || 10:15",
                classroom: "قاعه رقم 26",
              },
              الكترونيك: {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 31",
              },
              "اجهزه وقياسات": {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 27",
              },
            },
          },
          E: {
            lectures: {
              "معماريه الحاسوب": {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 27",
              },
              "اجهزه وقياسات": {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 26",
              },
              الكترونيك: {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 31",
              },
            },
          },
          F: {
            lectures: {
              "معماريه الحاسوب": {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 27",
              },
              "اجهزه وقياسات": {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 26",
              },
              الكترونيك: {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 31",
              },
            },
          },
          مسائي: {
            lectures: {
              "معماريه الحاسوب": {
                time: "2:00 || 4:00",
                classroom: "قاعه رقم 26",
              },
              "معماريه الحاسوب ( عملي )": {
                time: "4:00 || 5:00",
                classroom: "م.معماريه",
              },
              "اجهزه وقياسات": {
                time: "5:00 || 7:00",
                classroom: "قاعه رقم 26",
              },
              "اجهزه وقياسات ( عملي )": {
                time: "7:00 | 8:00",
                classroom: "م.دوائر",
              },
            },
          },
        },
      },
      {
        day: "الثلاثاء",
        groups: {
          A: {
            lectures: {
              رياضيات: {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 26",
              },
              الكترونيك: {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 25",
              },
              "تطبيقات الحاسوب": {
                time: "12:30 || 2:00",
                classroom: "م.تطبيقات",
              },
            },
          },
          B: {
            lectures: {
              رياضيات: {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 26",
              },
              الكترونيك: {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 25",
              },
            },
          },
          C: {
            lectures: {
              "معماريه الحاسوب": {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 25",
              },
              "معماريه الحاسوب ( عملي )": {
                time: "10:30 || 11:15",
                classroom: "م.معماريه",
              },
              رياضيات: {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 25",
              },
            },
          },
          D: {
            lectures: {
              "معماريه الحاسوب": {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 25",
              },
              "تطبيقات الحاسوب": {
                time: "10:30 || 12:15",
                classroom: "م.تطبيقات",
              },
              رياضيات: {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 25",
              },
            },
          },
          E: {
            lectures: {
              "تطبيقات الحاسوب": {
                time: "8:30 || 10:15",
                classroom: "م.تطبيقات",
              },
              رياضيات: {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 26",
              },
              "جرائم حزب البعث": {
                time: "1:15 || 2:00",
                classroom: "قاعه رقم 26",
              },
            },
          },
          F: {
            lectures: {
              رياضيات: {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 26",
              },
              "جرائم حزب البعث": {
                time: "1:15 || 2:00",
                classroom: "قاعه رقم 26",
              },
            },
          },
          مسائي: {
            lectures: {
              "جرائم حزب البعث": {
                time: "2:00 || 3:00",
                classroom: "قاعه رقم 26",
              },
              الكترونيك: {
                time: "3:00 || 5:00",
                classroom: "قاعه رقم 26",
              },
            },
          },
        },
      },
      {
        day: "الاربعاء",
        groups: {
          A: {
            lectures: {
              برمجه: {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 25",
              },
              "اجهزه وقياسات": {
                time: "10:30 || 11:15",
                classroom: "م.دوائر",
              },
              "معماريه الحاسوب": {
                time: "11:30 || 12:15",
                classroom: "م.معماريه",
              },
              اتصالات: {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 26",
              },
            },
          },
          B: {
            lectures: {
              برمجه: {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 25",
              },
              "معماريه الحاسوب": {
                time: "10:30 || 11:15",
                classroom: "م.معماريه",
              },
              "اجهزه وقياسات": {
                time: "11:30 || 12:15",
                classroom: "م.دوائر",
              },
              اتصالات: {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 26",
              },
            },
          },
          C: {
            lectures: {
              اتصالات: {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 26",
              },
              برمجه: {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 25",
              },
              "اجهزه وقياسات": {
                time: "12:30 || 1:15",
                classroom: "م.دوائر",
              },
            },
          },
          D: {
            lectures: {
              اتصالات: {
                time: "8:30 || 10:15",
                classroom: "قاعه رقم 26",
              },
              برمجه: {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 25",
              },
              "معماريه الحاسوب": {
                time: "12:30 || 1:15",
                classroom: "م.معماريه",
              },
              "اجهزه وقياسات": {
                time: "1:15 || 2:00",
                classroom: "م.دوائر",
              },
            },
          },
          E: {
            lectures: {
              "اجهزه وقياسات": {
                time: "8:30 || 9:15",
                classroom: "م.دوائر",
              },
              "معماريه الحاسوب": {
                time: "9:30 || 10:15",
                classroom: "م.معماريه",
              },
              اتصالات: {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 26",
              },
              برمجه: {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 25",
              },
            },
          },
          F: {
            lectures: {
              "معماريه الحاسوب": {
                time: "8:30 || 9:15",
                classroom: "م.معماريه",
              },
              "اجهزه وقياسات": {
                time: "9:30 || 10:15",
                classroom: "م.دوائر",
              },
              اتصالات: {
                time: "10:30 || 12:15",
                classroom: "قاعه رقم 26",
              },
              برمجه: {
                time: "12:30 || 2:00",
                classroom: "قاعه رقم 25",
              },
            },
          },
          مسائي: {
            lectures: {
              برمجه: {
                time: "2:00 || 4:00",
                classroom: "قاعه رقم 26",
              },
              رياضيات: {
                time: "4:00 || 6:00",
                classroom: "قاعه رقم 26",
              },
              اتصالات: {
                time: "6:00 || 8:00",
                classroom: "قاعه رقم 26",
              },
            },
          },
        },
      },
      {
        day: "الخميس",
        groups: {
          A: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          B: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          C: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          D: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          E: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          F: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
          مسائي: {
            lectures: {
              " لايوجد محاضرات اليوم ": {
                classroom: "",
              },
            },
          },
        },
      },
    ],
  },
];
